#Напишите программу, которая принимает целое число x и определяет, принадлежит ли данное число указанному промежутку
a = int(input())
if -1<a<17:
    print('Принадлежит')
else:
    print('Не', 'принадлежит')
